[{"title": "Industrial Safety and Labour Rights in India", "content": ["Rising industrial accidents in India are due to negligence, cost-cutting, lack of training, weak enforcement, unregistered workers, and deliberate actions to claim insurance.", "Key labour laws include the Factories Act, 1948; Workmen’s Compensation Act, 1923; Employees’ State Insurance (ESI) Act, 1948; Payment of Wages Act, 1936; Minimum Wages Act, 1948; Industrial Disputes Act, 1947; and the Occupational Safety, Health and Working Conditions (OSHWC) Code, 2020.", "Challenges include systemic erosion of legal safeguards, normalization of informality, gendered exclusion, corporate accountability deficits, and long-term economic impacts.", "Strengthening worker rights requires reinforcing legal safeguards, formalizing informal workers, skill development and safety training, gender-inclusive measures, corporate social responsibility (CSR) compliance, promoting collective action, and data-driven monitoring."], "importance": "absolutely_important"}, {"title": "Carbon Capture, Usage and Storage (CCUS)", "content": ["CCUS technologies capture CO₂ emissions or remove CO₂ from the atmosphere, involving capture, transport, and storage or use.", "Capture methods include post-combustion, pre-combustion, and oxy-fuel combustion.", "Asia’s increasing reliance on CCUS raises concerns about potential excess emissions, economic lock-in, regional vulnerabilities, and growing energy demand.", "India has limited CCS infrastructure, but is establishing CCU testbeds for the cement sector and National Centres of Excellence in Carbon Capture.", "Key concerns include low capture efficiency, fossil fuel dependence, high economic costs, sectoral misalignment, emergence of cheaper alternatives, and environmental risks."], "importance": "absolutely_important"}, {"title": "Biomedical Research Career Programme (BRCP)", "content": ["The BRCP is a joint Indo-UK initiative launched in 2008–09 by the Department of Biotechnology (DBT), Government of India, and the Wellcome Trust, UK.", "Phase III of BRCP will be implemented from 2025–26 to 2030–31, targeting training 2,000 researchers.", "Main objectives are to build a world-class biomedical research ecosystem in India, support scientists, and encourage interdisciplinary research.", "Emerging frontiers include genomics & human genetics, infectious disease biology, vaccine development, diagnostics & medical devices, therapeutics & drug repurposing, biomedical engineering, and maternal & child health.", "India is globally recognized as the “Pharmacy of the World.”"], "importance": "important"}, {"title": "Nobel Peace Prize 2025", "content": ["The Nobel Peace Prize 2025 was awarded to Maria Corina Machado for her efforts to promote democratic rights in Venezuela.", "Machado founded the Atenea Foundation and co-founded Súmate to monitor elections.", "Since 1999, Venezuela has transitioned from a stable democracy to an authoritarian state."], "importance": "important"}, {"title": "Maitri II Research Station in Antarctica", "content": ["Maitri II is India’s upcoming and fourth research station in Antarctica, scheduled to be completed by January 2029.", "It is being built to replace the old Maitri station (1989), and is led by the National Centre for Polar and Ocean Research (NCPOR).", "It is planned as a 'green research base,' using renewable energy and advanced technology.", "Antarctica contains 75% of Earth’s freshwater, and studying its ice sheets is crucial for forecasting sea-level rise."], "importance": "important"}]