[{"title": "Why in News?", "content": "The Ministry of New and Renewable Energy is formulating a plan to create a fully indigenous solar manufacturing ecosystem by 2028, encompassing modules, cells, wafers, and ingots.", "summary": "The Ministry of New and Renewable Energy is planning to establish a fully indigenous solar manufacturing ecosystem by 2028, covering all key components."}, {"title": "What is the Solar Manufacturing Value Chain?", "content": "About: The solar manufacturing value chain encompasses the complete process of converting raw materials into a fully functional solar photovoltaic (PV) module. It is a sequential workflow and the chain is generally divided into Upstream (high-tech, capital-intensive) and Downstream (labor-intensive) segments.\nKey Stages: Upstream Manufacturing (The Core Components): Polysilicon: The process begins with metallurgical-grade silicon derived from quartz sand, which is then processed into polysilicon. Ingots: The polysilicon is melted and crystallized into large, cylindrical blocks called ingots. Wafers: Ingots are sliced into ultra-thin, disc-shaped sheets using a wire saw. These sheets, called wafers, are the fundamental building block of a solar cell. Solar Cell: The wafers undergo doping (adding phosphorus and boron to form an electric field), printing (metal contacts for electron flow), and anti-reflective coating to minimize light reflection. The result is a solar cell capable of converting sunlight into electricity. Downstream Manufacturing (Assembly & Installation): Module Manufacturing: Solar cells are interconnected, laminated, sealed between glass and polymer back sheets, and framed to form a solar module. System Installation & Integration: Modules are assembled into arrays, connected to inverters, mounting structures, and wiring, and installed on rooftops, fields, or solar farms.\nCurrent Status: India's solar module capacity has already touched 100 GW, but solar cell capacity is only 27 GW, while ingot and wafer capacity is just 2.2 GW, making it heavily reliant on imports, particularly from China. India aims to finalize a roadmap for Swadeshi polysilicon production in the coming years.\nProposed Reforms: A key step is the proposed expansion of the Approved List of Models and Manufacturers (ALMM), currently for modules, to include solar cells, wafers, and ingots. ALMM mandates that solar project developers purchase equipment from approved models and manufacturers, promoting domestic manufacturing and acting as a non-tariff barrier to low-quality or import-dependent products.", "summary": "The solar manufacturing value chain involves converting raw materials into solar modules, with upstream (polysilicon, ingots, wafers, solar cells) and downstream (module manufacturing, system installation) stages. India's reliance on imports, particularly from China, highlights the need for indigenous manufacturing and ALMM expansion."}, {"title": "What are the Challenges in Developing the Indigenous Solar Value Chain?", "content": "• H – High-Cost & Scale Issues: Indian-made components are initially expensive and less competitive due to dis-economies of scale (business's cost per unit increases instead of decreasing as it expands production).\n• U – Upstream Infrastructure Gaps: Polysilicon and wafer manufacturing is technology-intensive and capital-heavy, with limited domestic experience.\n• R – RoW & Land Bottlenecks: Land acquisition and Right of Way (RoW) issues block projects.\n• D – Delayed Power Purchase Agreements (PPAs): Procurement delays by States/Discoms hurt project viability.\n• L – Lack of Experience: Limited experience in advanced solar manufacturing.\n• E – Export/Import Dependence: Reliance on imports increases vulnerability.", "summary": "Challenges include high costs, upstream infrastructure gaps, land and RoW issues, PPA delays, lack of experience, and import dependence."}, {"title": "Achievements in Solar Energy", "content": "• Renewable Energy: India surpasses 251.5 GW non-fossil energy capacity, achieving over half of its 2030 target of 500 GW.\n• PM Suryaghar Yojana: India has already installed 20 lakh rooftop solar projects under the PM Suryaghar Yojana, with expectations to cross 50 lakh installations soon.\n• PM-KUSUM scheme: Under the PM-KUSUM scheme, over 1.6 million solar pumps have been installed or solarised, reducing diesel use by 1.3 billion litres annually and cutting CO2 emissions by 40 million tonnes.", "summary": "India has achieved significant milestones in renewable energy, including surpassing 251.5 GW non-fossil energy capacity, the PM Suryaghar Yojana, and the PM-KUSUM scheme."}, {"title": "What Steps are Needed to Develop a Indigenous Solar Value Chain in India?", "content": "• Mnemonic: SHINE\n• S – Sustained Policy Support: Expand ALMM, ensure stable PLI, phased customs duties, and clear technology acquisition plans.\n• H – Harness Investment: Build Greenfield manufacturing, provide capital support, and resolve land/RoW issues.\n• I – Innovation & R&D: Promote next-generation technologies like Perovskite and strengthen ancillary industries.\n• N – Navigate Coordination: Streamline state-level execution, ensure Discom financial stability, and align with schemes like PM Suryaghar Yojana and PM-KUSUM.\n• E – Expand Demand: Drive domestic solar manufacturing demand through policy and deployment programs.", "summary": "Key steps include sustained policy support, investment, innovation, coordination, and demand expansion to develop a robust indigenous solar value chain."}, {"title": "Conclusion", "content": "India’s green energy transition is crucial to achieving net-zero by 2070, with targets of 1,800 GW renewable capacity by 2047 and 5,000 GW by 2070. An integrated roadmap is needed: develop domestic solar manufacturing, resolve land and RoW bottlenecks, fast-track PPA signings, and institutionalize ALMM for wafers, ingots, and polysilicon, enhancing energy security, sustainability, and India’s global solar leadership.", "summary": "India's green energy transition requires an integrated roadmap focusing on domestic manufacturing, addressing bottlenecks, and institutionalizing ALMM to achieve net-zero targets and global leadership."}, {"title": "Why in News?", "content": "Great Nicobar Island (GNI) Project has drawn attention as one of India’s most ambitious infrastructure plans in the Indian Ocean Region (IOR).\n• Despite environmental concerns, the project is crucial for turning Great Nicobar into a global maritime hub while considering ecology and tribal welfare.", "summary": "The Great Nicobar Island (GNI) Project is a significant infrastructure plan in the Indian Ocean Region, aiming to create a global maritime hub while addressing environmental and tribal concerns."}, {"title": "What is the Great Nicobar Island (GNI) Project?", "content": "About: The GNI Project, conceived by NITI Aayog and launched in 2021, aims to build an International Container Transshipment Terminal (ICTT), a greenfield international airport, a township, and a gas–solar power plant. It is implemented by Andaman and Nicobar Islands Integrated Development Corporation (ANIIDCO). It aligns with India’s Maritime Vision 2030 and is one of the key projects under the Amrit Kaal Vision 2047.\nStrategic Significance: Transshipment Hub: The ICTT reduces India’s reliance on foreign ports like Singapore and Colombo, integrating India into global supply chains. Greenfield Airport: Enhances civilian connectivity, tourism, and dual-use defence capability. Strategic Positioning Advantage: Nicobar’s location near the Malacca, Sunda, and Lombok Straits allows India to monitor vital sea lanes for global trade and energy supply. Great Nicobar’s location gives India proximity to Sabang (Indonesia), Coco Island (Myanmar), and the proposed Kra Canal (Thailand), underscoring its central role in Indo-Pacific sea routes. Great Nicobar lies almost equidistant from Colombo, Port Klang, and Singapore, placing India at the centre of regional sea trade. Maritime Security: The Andaman & Nicobar Islands serve as India’s first line of maritime defence and share sea boundaries with Myanmar, Thailand, Indonesia, and Bangladesh, giving India a vast exclusive economic zone and continental shelf under United Nations Conference on the Laws of the Sea, 1982 (UNCLOS). GNI strengthens India’s naval reach in the Indo-Pacific, countering piracy, trafficking, terrorism, and great-power rivalries. Positions India as a proactive maritime power amidst rising presence of China and other navies in the IOR. Policy Alignment: Supports Act East Policy (2014) and the QUAD’s Indo-Pacific strategy, strengthening India’s role in regional security.\n• It is implemented by Andaman and Nicobar Islands Integrated Development Corporation (ANIIDCO).\n• It aligns with India’s Maritime Vision 2030 and is one of the key projects under the Amrit Kaal Vision 2047.\n• Transshipment Hub: The ICTT reduces India’s reliance on foreign ports like Singapore and Colombo, integrating India into global supply chains.\n• Greenfield Airport: Enhances civilian connectivity, tourism, and dual-use defence capability.\n• Strategic Positioning Advantage: Nicobar’s location near the Malacca, Sunda, and Lombok Straits allows India to monitor vital sea lanes for global trade and energy supply. Great Nicobar’s location gives India proximity to Sabang (Indonesia), Coco Island (Myanmar), and the proposed Kra Canal (Thailand), underscoring its central role in Indo-Pacific sea routes. Great Nicobar lies almost equidistant from Colombo, Port Klang, and Singapore, placing India at the centre of regional sea trade.\n• Maritime Security: The Andaman & Nicobar Islands serve as India’s first line of maritime defence and share sea boundaries with Myanmar, Thailand, Indonesia, and Bangladesh, giving India a vast exclusive economic zone and continental shelf under United Nations Conference on the Laws of the Sea, 1982 (UNCLOS). GNI strengthens India’s naval reach in the Indo-Pacific, countering piracy, trafficking, terrorism, and great-power rivalries. Positions India as a proactive maritime power amidst rising presence of China and other navies in the IOR.\n• Policy Alignment: Supports Act East Policy (2014) and the QUAD’s Indo-Pacific strategy, strengthening India’s role in regional security.\n• Great Nicobar’s location gives India proximity to Sabang (Indonesia), Coco Island (Myanmar), and the proposed Kra Canal (Thailand), underscoring its central role in Indo-Pacific sea routes.\n• Great Nicobar lies almost equidistant from Colombo, Port Klang, and Singapore, placing India at the centre of regional sea trade.\n• GNI strengthens India’s naval reach in the Indo-Pacific, countering piracy, trafficking, terrorism, and great-power rivalries.\n• Positions India as a proactive maritime power amidst rising presence of China and other navies in the IOR.\n• Tribal Safeguards: Large-scale development in GNI is permitted only after consultations with the Ministry of Tribal Affairs, Directorate of Tribal Welfare and Andaman Adim Janjati Vikas Samiti (AAJVS), as mandated by the Jarawa Policy (2004) and Shompen Policy (2015). The policies appoint AAJVS as the trustee of Particularly Vulnerable Tribal Groups (PVTGs) and ensure the Shompen community’s welfare is given top priority in all major projects. In line with this, the Empowered Committee, after mandatory consultation with the National Commission for Scheduled Tribes (NCST) under Article 338A(9), confirmed that tribal interests will remain protected.\n• Environmental Safeguards: The Project incorporates strict environmental safeguards, following the Environmental Impact Assessment (EIA) Notification, 2006, and based on detailed EIAs and an Environmental Management Plan (EMP). To protect wildlife, 8 corridors have been planned to ensure the safe movement of arboreal animals, snakes, crabs, and crocodiles, minimizing ecological disruption during development. To compensate for tree felling caused by the GNI project, compensatory afforestation is planned in Haryana, as the Andaman & Nicobar Islands already have over 75% forest cover.\n• The policies appoint AAJVS as the trustee of Particularly Vulnerable Tribal Groups (PVTGs) and ensure the Shompen community’s welfare is given top priority in all major projects. In line with this, the Empowered Committee, after mandatory consultation with the National Commission for Scheduled Tribes (NCST) under Article 338A(9), confirmed that tribal interests will remain protected.\n• In line with this, the Empowered Committee, after mandatory consultation with the National Commission for Scheduled Tribes (NCST) under Article 338A(9), confirmed that tribal interests will remain protected.\n• To protect wildlife, 8 corridors have been planned to ensure the safe movement of arboreal animals, snakes, crabs, and crocodiles, minimizing ecological disruption during development.\n• To compensate for tree felling caused by the GNI project, compensatory afforestation is planned in Haryana, as the Andaman & Nicobar Islands already have over 75% forest cover.", "summary": "The GNI Project, encompassing an ICTT, airport, township, and power plant, aims to reduce reliance on foreign ports, enhance connectivity, and strengthen India's strategic position and maritime security. It also incorporates tribal and environmental safeguards."}, {"title": "Great Nicobar Island", "content": "The Andaman and Nicobar Islands comprise 836 islands, divided by the Ten Degree Channel into the Andamans (north) and Nicobars (south).\n• Great Nicobar, the largest Nicobar island (910 sq km of rainforest). It hosts Indira Point, India’s southernmost tip, just 90 nautical miles from Sumatra (Indonesia).\n• Great Nicobar has two national parks, a biosphere reserve, small populations of the Shompen and Nicobarese tribal peoples, and a few thousand non-tribal settlers.\n• Great Nicobar Biosphere Reserve was included in the list of Man and Biosphere (MAB) Program of UNESCO in 2013.", "summary": "Great Nicobar, the largest Nicobar island, is home to Indira Point, national parks, a biosphere reserve, and tribal communities. It's part of the UNESCO Man and Biosphere program."}, {"title": "Conclusion", "content": "The Great Nicobar Island Project is not merely an infrastructure plan but a strategic-economic multiplier. It secures India’s maritime future, reduces logistical dependence on foreign ports, and unlocks regional growth, thereby positioning India as a major player in the Indo-Pacific.", "summary": "The GNI Project is a strategic-economic initiative that aims to strengthen India's maritime future, reduce dependence on foreign ports, and promote regional growth in the Indo-Pacific."}, {"title": "Why in News?", "content": "Adivasis from the Ho tribe in Jharkhand’s Kolhan region protested against alleged administrative interference in the Manki-Munda system, with tensions driven by vacant posts, hereditary inefficiencies, and calls for reforms.", "summary": "Ho tribe Adivasis in Jharkhand protested against alleged administrative interference, vacant posts, hereditary inefficiencies and called for reforms in the Manki-Munda system."}, {"title": "What is the Manki-Munda System?", "content": "Manki-Munda System: It is a centuries-old self-governance framework of the Ho adivasi community. Each village is led by a hereditary Munda, responsible for resolving local disputes, while a group of 8–15 villages, called a pidh, is overseen by a Manki, handling cases unresolved at the village level. The system is decentralized and purely socio-political, with no role in revenue collection, land management, or taxation.\n• British Intervention: Post-Battle of Plassey (1757) and Buxar (1764), East India Company gained diwani rights, introducing taxation. Permanent Settlement Act (1793) forced zamindars to extract land revenue, seizing Ho lands, triggering Ho (1821–22) and Kol (1831) revolts. To manage the region, the British co-opted the Manki-Munda system instead of suppressing it. Captain Thomas Wilkinson (1833) codified the system in Wilkinson’s Rules, formally recognising Mundas and Mankis and integrating them into colonial administration. This introduced private property and pattas, transforming collective landholding to individual ownership and led to demographic changes with influx of outsiders (dikkus).\n• Post-Independence: Kolhan largely retained Wilkinson’s Rules, with courts recognizing them as valid customary practices until Mora Ho vs State of Bihar (2000), in which the Patna High Court clarified they are customs, not formal law, but allowed continued practice. 2021 Jharkhand initiative (Nyay Manch) proposed reform, but not enacted.\n• Each village is led by a hereditary Munda, responsible for resolving local disputes, while a group of 8–15 villages, called a pidh, is overseen by a Manki, handling cases unresolved at the village level.\n• The system is decentralized and purely socio-political, with no role in revenue collection, land management, or taxation.\n• Permanent Settlement Act (1793) forced zamindars to extract land revenue, seizing Ho lands, triggering Ho (1821–22) and Kol (1831) revolts.\n• To manage the region, the British co-opted the Manki-Munda system instead of suppressing it.\n• Captain Thomas Wilkinson (1833) codified the system in Wilkinson’s Rules, formally recognising Mundas and Mankis and integrating them into colonial administration.\n• This introduced private property and pattas, transforming collective landholding to individual ownership and led to demographic changes with influx of outsiders (dikkus).\n• 2021 Jharkhand initiative (Nyay Manch) proposed reform, but not enacted.", "summary": "The Manki-Munda system is a self-governance framework of the Ho Adivasi community, co-opted by the British. It's a socio-political system, with no role in revenue collection."}, {"title": "What are the Key Facts About Ho Tribe?", "content": "About: The Ho or Kolha are an Austroasiatic Munda ethnic group of India, concentrated mainly in Jharkhand’s Kolhan region and parts of Odisha, with smaller populations in West Bengal, Bihar, Bangladesh, and Nepal.\n• Language: Speak Ho language, an Austroasiatic tongue related to Mundari. It is written in Devanagari, Latin, and Warang Citi (native script developed by Lako Bodra).\n• History: Ho presence dates back around 4000–3500 years, with migrations from Southeast Asia. They took part in the Kol uprising (1831–33) against exploitative non-tribal landlords (dikkus). Also active in the 1857 revolt under the Raja of Porahat. Traditionally resisted Mughal, Maratha, and British incursions.\n• Society & Culture: Strong self-governance through the Manki-Munda system in Kolhan. Rich festival traditions like Mage Parab (creator god festival), Baa Parab (festival of flowers), Sohrai (agricultural festival), and Jomnama Parab (harvest). Dance and music central to culture; performances held in the akhra (village ground).\n• Economy & Forests: Over 80% of the Ho people are engaged in agriculture, and they were among the first adivasi communities to adopt settled farming, with some also involved in mining activities. Strong dependence on sal forests. The community strongly resists replacement of sal with teak plantations.\n• It is written in Devanagari, Latin, and Warang Citi (native script developed by Lako Bodra).\n• They took part in the Kol uprising (1831–33) against exploitative non-tribal landlords (dikkus). Also active in the 1857 revolt under the Raja of Porahat. Traditionally resisted Mughal, Maratha, and British incursions.\n• Rich festival traditions like Mage Parab (creator god festival), Baa Parab (festival of flowers), Sohrai (agricultural festival), and Jomnama Parab (harvest).\n• Dance and music central to culture; performances held in the akhra (village ground).\n• Strong dependence on sal forests. The community strongly resists replacement of sal with teak plantations.", "summary": "The Ho tribe, an Austroasiatic group, primarily reside in Jharkhand. They have a rich culture, a history of resistance, and depend heavily on agriculture and forests."}, {"title": "Why in News?", "content": "The Prime Minister inaugurated India’s first bamboo-based bioethanol plant in Golaghat, Assam, marking a major step toward energy self-sufficiency and green energy promotion.", "summary": "India's first bamboo-based bioethanol plant was inaugurated in Golaghat, Assam."}, {"title": "Rapid Fire", "content": "• Economic Impact: Bioethanol plant will source 5 lakh tonnes of bamboo annually from Assam and other northeastern states. The project will benefit local farmers and tribal communities, providing a Rs 200-crore boost to Assam’s rural economy. After the amendment to the Indian Forest Act, 1927, bamboo is no longer classified as a tree, lifting the ban on its cutting. This change supports the livelihoods of forest communities and private growers. It aligns with India’s Viksit Bharat vision, focusing on hydrocarbon exploration and green energy initiatives, and aims to reduce dependence on fossil fuels.\n• Bioethanol: It is a high-octane biofuel (C2H5OH) produced biologically from biomass like corn, sugarcane, grains, bamboo and vegetable residues. It is mainly used as a gasoline additive, with engines now capable of burning pure ethanol. Key production steps include fermentation of sugars, pretreatment of starch or cellulose, distillation, and dehydration to fuel-grade ethanol.\n• After the amendment to the Indian Forest Act, 1927, bamboo is no longer classified as a tree, lifting the ban on its cutting. This change supports the livelihoods of forest communities and private growers.\n• It aligns with India’s Viksit Bharat vision, focusing on hydrocarbon exploration and green energy initiatives, and aims to reduce dependence on fossil fuels.\n• It is mainly used as a gasoline additive, with engines now capable of burning pure ethanol.\n• Key production steps include fermentation of sugars, pretreatment of starch or cellulose, distillation, and dehydration to fuel-grade ethanol.", "summary": "The bioethanol plant will boost Assam's rural economy. Bamboo is no longer classified as a tree, supporting livelihoods. Bioethanol is produced biologically from biomass and used as a gasoline additive."}, {"title": "Rapid Fire", "content": "INS Aravali, Indian Navy's latest Naval Base, was commissioned at Gurugram to strengthen Maritime Domain Awareness (MDA) capability.", "summary": "INS Aravali, a new naval base, has been commissioned in Gurugram to enhance Maritime Domain Awareness."}, {"title": "INS Aravali", "content": "INS Aravali, deriving its name from the unwavering Aravali range.\n• It is designed to strengthen the Navy’s information and communication infrastructure. It would not only be a hub of technology, but also of a collaborative vision of MAHASAGAR.\n• The base is guided by its motto: ‘सामुद्रिक सुरक्षायाः सहयोगं’ (Maritime Security through Collaboration).\n• It will help various information and communication centers of the Indian Navy, and strengthen India’s Command, Control, Communications, and Maritime Domain Awareness (MDA) framework.\n• Reinforce India’s position as the Preferred Security Partner in the Indian Ocean Region.", "summary": "INS Aravali strengthens the Indian Navy's information, communication, and MDA capabilities and reinforces India's role in the Indian Ocean Region."}, {"title": "Place In News", "content": "The Philippines has strongly opposed China’s announcement to establish a nature reserve in the South China Sea at the disputed Scarborough Shoal, which has long been a flashpoint of tensions and standoffs between the two countries.", "summary": "The Philippines has opposed China's announcement of a nature reserve in the disputed Scarborough Shoal."}, {"title": "Scarborough Shoal", "content": "About: It is a triangular atoll, located 200 km from the Philippines coast, and within its exclusive economic zone (EEZ) under UNCLOS (1982). It is part of the broader South China Sea disputes (Spratlys, Paracels, Nine-Dash Line), where China’s nine-dash line overlaps with the EEZs of Vietnam, Malaysia, Brunei, and Indonesia.\n• Significance: Rich in fish stocks and provides natural shelter for vessels. Strategically placed near shipping lanes that handle USD 3 trillion annual global trade. Control gives a geopolitical and military edge in one of the busiest waterways.\n• The 2016 Permanent Court of Arbitration ruling rejected China’s broad South China Sea claims and its blockade of the shoal, but left the sovereignty issue unresolved, causing ongoing tensions.\n• It is part of the broader South China Sea disputes (Spratlys, Paracels, Nine-Dash Line), where China’s nine-dash line overlaps with the EEZs of Vietnam, Malaysia, Brunei, and Indonesia.\n• Strategically placed near shipping lanes that handle USD 3 trillion annual global trade.\n• Control gives a geopolitical and military edge in one of the busiest waterways.", "summary": "Scarborough Shoal, a disputed area in the South China Sea, is rich in fish stocks and strategically important. The 2016 ruling did not resolve the sovereignty issue."}, {"title": "Rapid Fire", "content": "India is turning to Contracts for Difference (CfD) as a central mechanism to mobilize nearly USD 1 trillion in green finance for its 500 GW renewable energy target by 2030.", "summary": "India is adopting Contracts for Difference (CfD) to mobilize nearly USD 1 trillion in green finance for its renewable energy goals."}, {"title": "Contracts for Difference (CfD)", "content": "CfD is a financial agreement between renewable energy producers and the government to stabilize revenues. If market prices fall below an agreed strike price, the government pays the producer the difference and if prices rise above it, the producer returns the surplus. CfDs reduce risk and are widely used in Europe for renewable projects.\n• Green finance encompasses financial products and services designed to promote environmental sustainability. To meet its Paris Agreement targets, India needs USD 2.5 trillion by 2030.\n• India needs USD 10 trillion by 2070 for its net zero goal, focusing on green finance as essential for development.\n• Green Financing Initiatives in India: India finances renewable energy through the National Clean Energy and Environment Fund (NCEEF) funded by coal cess. Indian Renewable Energy Development Agency (IREDA) concessional loans. Priority Sector Lending (PSL) mandated by the Reserve Bank of India. Green, Social, and Sustainability (GSS) Bonds. Carbon markets and credits, and crowdfunding platforms like Bettervest for rural projects.\n• CfDs reduce risk and are widely used in Europe for renewable projects.\n• Indian Renewable Energy Development Agency (IREDA) concessional loans.\n• Priority Sector Lending (PSL) mandated by the Reserve Bank of India.\n• Green, Social, and Sustainability (GSS) Bonds.\n• Carbon markets and credits, and crowdfunding platforms like Bettervest for rural projects.", "summary": "CfDs stabilize renewable energy revenues, reducing risk. India aims to use green financing, including NCEEF, IREDA loans, and green bonds, to achieve its renewable energy and net-zero goals."}]