[{"title": "Why Keshav Prasad Maurya’s new Bihar assignment has rekindled talk of a ‘bigger national role’", "content": "Why Keshav Prasad Maurya’s new Bihar assignment has rekindled talk of a ‘bigger national role’", "summary": "This section discusses the implications of Keshav Prasad Maurya's new assignment in Bihar and how it has sparked discussions about his potential for a larger national role."}, {"title": "India’s ‘Butter Chicken’ makes it to ‘best chicken dishes in the world’ list; here’s where it ranks", "content": "India’s ‘Butter Chicken’ makes it to ‘best chicken dishes in the world’ list; here’s where it ranks", "summary": "This section reports on the ranking of India's Butter Chicken in a global list of best chicken dishes."}, {"title": "SC strikes down Vanashakti judgment: Why ruling is significant", "content": "SC strikes down Vanashakti judgment: Why ruling is significant", "summary": "This section analyzes the Supreme Court's decision to strike down the Vanashakti judgment and explains the significance of the ruling."}, {"title": "Gaurav Khanna’s wife Akanksha opens up about her decision to not have a child: ‘I have not felt the inclination to become a mother’", "content": "Gaurav Khanna’s wife Akanksha opens up about her decision to not have a child: ‘I have not felt the inclination to become a mother’", "summary": "This section features Akanksha, Gaurav Khanna's wife, discussing her decision not to have a child."}, {"title": "Teacher mocked my son, says father of Class 10 student who died by suicide at Delhi’s Rajendra Place metro station", "content": "Teacher mocked my son, says father of Class 10 student who died by suicide at Delhi’s Rajendra Place metro station", "summary": "This section presents the father's account of a Class 10 student's suicide, alleging that a teacher mocked his son."}, {"title": "Jai Ram questions Cong govt’s 3-year celebration  with state still recovering from disaster", "content": "Jai Ram questions Cong govt’s 3-year celebration  with state still recovering from disaster", "summary": "This section reports on Jai Ram's questioning of the Congress government's 3-year celebration, given the state's ongoing recovery from a disaster."}, {"title": "Decode Politics: Why KTR is under Hyderabad Formula E cloud as Governor clears prosecution", "content": "Decode Politics: Why KTR is under Hyderabad Formula E cloud as Governor clears prosecution", "summary": "This section analyzes the political implications of KTR's situation related to the Hyderabad Formula E event, following the Governor's decision to clear prosecution."}, {"title": "‘Yeh leaders ko ho kya gaya hai’: Shark Tank India’s Namita Thapar reacts to Sridhar Vembu’s ‘marry in 20s’ advice", "content": "‘Yeh leaders ko ho kya gaya hai’: Shark Tank India’s Namita Thapar reacts to Sridhar Vembu’s ‘marry in 20s’ advice", "summary": "This section features Namita Thapar from Shark Tank India reacting to Sridhar Vembu's advice on marrying in one's 20s."}, {"title": "Sunita Ahuja loves Govinda till last breath, but cannot tolerate emotional cheating: ‘Don’t do physical cheating either’", "content": "Sunita Ahuja loves Govinda till last breath, but cannot tolerate emotional cheating: ‘Don’t do physical cheating either’", "summary": "This section reports on Sunita Ahuja's views on emotional and physical cheating in the context of her relationship with Govinda."}, {"title": "47-year-old land dispute: Punjab and Haryana High Court upholds protection for bona fide buyer", "content": "47-year-old land dispute: Punjab and Haryana High Court upholds protection for bona fide buyer", "summary": "This section discusses the Punjab and Haryana High Court's ruling in a 47-year-old land dispute, upholding protection for a bona fide buyer."}, {"title": "Gen-Z protests erupt in Nepal again, curfew imposed", "content": "Gen-Z protests erupt in Nepal again, curfew imposed", "summary": "This section reports on the renewed protests by Gen-Z in Nepal and the imposition of a curfew."}, {"title": "ExplainSpeaking: How Trump’s tariffs have run into an affordability crisis", "content": "ExplainSpeaking: How Trump’s tariffs have run into an affordability crisis", "summary": "This section explains how Trump's tariffs have contributed to an affordability crisis."}, {"title": "Punjab man with links to Pakistan’s ISI handlers killed in encounter, aide escapes, say Amristar police", "content": "Punjab man with links to Pakistan’s ISI handlers killed in encounter, aide escapes, say Amristar police", "summary": "This section reports on the killing of a Punjab man linked to Pakistan's ISI handlers in an encounter, according to Amritsar police."}, {"title": "Women celebrities are done with ‘fun’ questions, they are answering back", "content": "Women celebrities are done with ‘fun’ questions, they are answering back", "summary": "This section discusses how women celebrities are responding to questions."}, {"title": "Improved facilities, fair officiating, qualified coaches: Vijay Gujar from Pune outlines his vision as Maharashtra Boxing Coaching Commission chairman", "content": "Improved facilities, fair officiating, qualified coaches: Vijay Gujar from Pune outlines his vision as Maharashtra Boxing Coaching Commission chairman", "summary": "This section features Vijay Gujar's vision for the Maharashtra Boxing Coaching Commission, focusing on improved facilities, fair officiating, and qualified coaches."}]