[
    {
        "title": "Why in News?",
        "content": "IndiaandCanadahave agreed on a series ofmeasurestorestore bilateral relations, as announced in ajoint statementtitled ‘Renewing Momentum Towards a Stronger Partnership’by theirforeign ministers.",
        "summary": "India and Canada have agreed on measures to restore bilateral relations, announced in a joint statement titled 'Renewing Momentum Towards a Stronger Partnership'."
    },
    {
        "title": "What are the Key Highlights of India-Canada Joint Statement on Strengthening their Partnership?",
        "content": "• Adoption of New Roadmap:It is anew frameworkfor the relationship, based onmutual respect, shared democratic values, rule of law, sovereignty, and territorial integrity, aiming torestore stabilityand build aconstructive partnership.\n• Trade and Economic Cooperation:TheCanada-India CEO Forumwill resume inearly 2026.Ministerial talkswill focus onboosting bilateral trade and investment, with priority given toclean technology, infrastructure, agri-food, and digital innovation.\n• Clean Energy & Climate Action:To advanceenergy cooperation, aCritical MineralsAnnual Dialoguewill begin inMarch 2026, and theCanada-India Ministerial Energy Dialogue (CIMED)will be revived.Collaborationwill focus ongreen hydrogen,biofuels,Carbon Capture, and electric mobility.\n• Science, Technology, and Digital Ties:TheJoint Science and Technology Cooperation Committee (JSTCC)will be restarted. InAI collaboration,Canadawill joinIndia'sAI Impact Summit 2026, and both countries will exploredigital public infrastructurecooperation.\n• People-to-People Links:Both nations committed torefreshed collaborationinhigher education, includingAIandcybersecurityresearchand exploringCanadian university campuses in India.To facilitate this, theJoint Working Group on Higher Educationwill berevitalizedto expandacademic networks.",
        "summary": "The joint statement highlights a new roadmap based on mutual respect, trade and economic cooperation, clean energy and climate action, science and technology ties, and people-to-people links to strengthen the partnership."
    },
    {
        "title": "What are the Key Highlights of India-Canada Bilateral Relations?",
        "content": "• Economic & Trade Partnership:Bilateral tradeingoods and servicesexceeded26 billionCanadian dollars (CAD)in 2023.Significant investmentsare highlighted by overCAD 75 billionfromCanadian pension fundsand a presence of over600 Canadian companiesinIndia.\n• Energy & Civil Nuclear Cooperation:Under theNuclear Cooperation Agreement (2010),Canadais a keyuranium suppliertoIndia. A separateministerial-level Energy Dialoguecoversoil, gas, renewables, electricity, and clean technologies.\n• Security & Legal Frameworks:Security collaborationis based on aJoint Working Group (JWG) on Counter Terrorism (1997)and aFramework for Cooperation on Countering Terrorism (2018), whilelegal cooperationis strengthened by anExtradition Treaty (1987)and aMutual Legal Assistance Treaty(1994).\n• Science & Technology:ISROand theCanadian Space Agency (CSA)haveMoUs, andISRO’s commercial arm,ANTRIX, has launched severalCanadian nanosatellites.\n• People-to-People & Educational Links:Canadahosts one of the largestIndian diasporasabroad, with nearly1.8 million people of Indian origincontributing significantly tosociety and economy.Indiais also a top source ofinternational studentsfor Canada, with about427,000 Indian studentsstudying there.",
        "summary": "Highlights of India-Canada relations include economic and trade partnerships, energy and civil nuclear cooperation, security and legal frameworks, science and technology, and strong people-to-people and educational links."
    },
    {
        "title": "What are the Major Challenges in India-Canada Relations?",
        "content": "• Khalistan Issue:India accuses Canada of allowingKhalistaniseparatiststo operate freely—organizing rallies, glorifying violence, and funding activities todestabilize India.India views it as a national security threatand blames Canada for inaction againstincitement and foreign interference.\n• Trade and Economic Disruptions:Due to thepolitical rift, negotiations for aComprehensive Economic Partnership Agreement (CEPA)have been officiallypaused since 2023and are effectivelyfrozen.Thediplomatic fallouthas created anunpredictable environment, discouragingnew investmentsandpartnerships.\n• Diplomatic Strain:Thepublic accusations,expulsions, andpause in official dialogueshaveerodedthefoundational trustnecessary for afunctional bilateral relationship.\n• Strategic Misalignment:Indialeads incountering Chinese influencein theIndo-Pacificand is a keyQuadmember, whileCanada’s approach to Chinais inconsistent, balancingeconomic interestsandsecurity concerns.Canada’s foreign policyaligns withFive Eyespartners (US, UK, Australia, NZ), whereasIndia-US relationsinvolve a complex balance, especially regardingRussia.\n• Divergence in Global Governance: Canadaemphasizes arules-based international orderwith focus onhuman rightsandinternational law, whileIndiasupports these principles but prioritizesstrategic autonomy,national development, andreformed multilateralism, viewing institutions like theUN Security Councilas outdated.",
        "summary": "Major challenges include the Khalistan issue, trade and economic disruptions, diplomatic strain, strategic misalignment, and divergence in global governance."
    },
    {
        "title": "What Measures can be Taken to Strengthen India-Canada Relations?",
        "content": "• Diplomatic Recalibration:Establish aBilateral Security and Sovereignty Dialogueat theNational Security Advisorlevelto addressKhalistani extremismwith protocols forintelligence sharing, andlegal cooperation.Institute a2+2 Dialogue Mechanismto bridgestrategic misalignmentonIndo-Pacific security,counter-terrorism, andmaritime cooperation.\n• Economic Integration:Adopt atime-bound, sector-specific approachwithEarly Harvest Agreementsin less contentious sectors likeclean technology,agri-tech, anddigital servicesto revive CEPA.\n• Technological Cooperation:Fast-track theCritical Minerals Dialogueandenergy talksto positionCanadaas a key partner inIndia's green transitionthrough technology and financing forGreen Hydrogen, andelectric mobility.Establish anIndia-Canada Innovation Bridgeto foster collaboration betweenstartups,venture capital, andjoint R&Dinquantum computing,cybersecurity, andsemiconductors.\n• Strengthening the Human Capital:PursueCanadian university campuses in Indiaunder the newForeign Educational Institutions (FEI) regulations,2023, focusing onjoint/dual degree programsandresearch inSTEMfieldsto enhanceeducational exchange.Engage the1.8 million-strong Indian diasporaby deepeningcultural tiesthrough expandedfestivals,art, andfilm collaborations.",
        "summary": "Measures to strengthen relations include diplomatic recalibration, economic integration, technological cooperation, and strengthening human capital."
    },
    {
        "title": "Conclusion",
        "content": "The renewedIndia-Canada engagement, anchored by the2025 joint statement, aims to restoretrust, driveeconomic synergy, advancetechnologicalandclean energy cooperation, and deepenpeople-to-people bonds. Overcominglegacy challengesthroughstructured dialoguesandsectoral integrationoffers both nations ablueprintforsustainable, future-ready bilateral relations.",
        "summary": "The renewed engagement aims to restore trust, drive economic synergy, advance technological and clean energy cooperation, and deepen people-to-people bonds for sustainable and future-ready relations."
    },
    {
        "title": "Frequently Asked Questions (FAQs)",
        "content": "1. What is the India-Canada Joint Statement 2025?It is a roadmap titledRenewing Momentum Towards a Stronger Partnership, aiming to restore bilateral relations through trade, energy, technology, and people-to-people ties.\n2. What are the major challenges in India-Canada relations?Key challenges include Khalistani extremism, stalled CEPA negotiations, diplomatic strain, strategic misalignment on China, and divergence in global governance priorities.\n3. What is the significance of the proposed Critical Minerals Annual Dialogue?This dialogue is vital for India's green energy transition, securing a mineral supply chain for batteries, EVs, and renewable technologies, with Canada as a resource-rich partner.",
        "summary": "FAQs cover the India-Canada Joint Statement 2025, major challenges in the relationship, and the significance of the Critical Minerals Annual Dialogue."
    },
    {
        "title": "Why in News?",
        "content": "NITI Aayoghas released a comprehensive report titled“India’s Blue Economy: Strategy for Harnessing Deep-Sea and Offshore Fisheries”, outlining a roadmap to sustainably unlock the vast potential of India’s marine resources, and strengthen theBlue Economy.",
        "summary": "NITI Aayog released a report on India’s Blue Economy outlining a roadmap to sustainably unlock the potential of India’s marine resources and strengthen the Blue Economy."
    },
    {
        "title": "What are the Key Highlights of NITI Aayog’s Report on India’s Blue Economy?",
        "content": "• Unlocking India’s Untapped Marine Potential:India is thesecond-largest fish-producing nation, contributing8% of global fish output. Fisheries support around30 million livelihoodsin the country. In FY 2023–24, fishery products exports earned Rs 60,523 crore.Despite this,deep-sea resources beyond the continental shelf remain largely unexploited.India’s Exclusive Economic Zone (EEZ)of over2 million sq. kmholds anestimated potential yield of 7.16 million tonnes.Harnessing these resources canreduce pressure on coastal fisheries,boost exports, andcreate employment.\n• Roadmap for Harnessing India’s Fisheries:The NITI Aayog report envisions athree-phase roadmapto unlock India’s deep-sea fisheries potential throughpolicy reform, technology, infrastructure, and sustainable practices.Phase 1 (2025–28) (Foundation and early growth):It focuses on setting up strong policy frameworks, building capacity through training and modern infrastructure, and launching pilot projects to test deep-sea fishing models.Phase 2 (2029–32) (Scaling up and achieving global competitiveness): Aims to expand fleets, upgrade harbours and processing facilities, andstrengthen India’s presence in global seafood marketsthrough innovation and sustainability.Phase 3 (2033 onwards) (Global leadership in sustainable deep-sea fisheries):It envisions India emerging as a world leader in sustainable deep-sea fisheries by promoting high-value products, ecosystem-based management, and international collaborations.",
        "summary": "The report highlights the untapped marine potential, outlines a three-phase roadmap for harnessing India’s fisheries, and aims to unlock deep-sea fisheries potential through policy reform, technology, infrastructure, and sustainable practices."
    },
    {
        "title": "What are the Key Challenges in India’s Deep-sea and Offshore Fisheries Highlighted by NITI Aayog?",
        "content": "• Lack of Scientific Stock Assessment:Inadequate data and limited use of modern tools like remote sensing, sonar, and AI for mapping deep-sea resourcescan lead to overfishing and unsustainable exploitation of marine resources.Overfishing,bycatch, andmarine pollutionthreaten ecosystem healthand can cause long-term decline of fish stocks and marine biodiversity.\n• Weak Infrastructure:Poor harbour facilities, insufficient landing centres, and limited cold chain and processing capacitycause post-harvest losses, reduced fish quality, and lower export potential.\n• Technological Gaps:Most vessels lack modernfish-finding equipment,vessel monitoring systems (VMS), and selective fishing gearleading to inefficient fishing, high bycatch, and compromised sustainability.\n• Limited Access to Finance:Fisher cooperatives and small operators face difficulties getting institutional credit or insurance coverageresulting in underinvestment in technology and risk mitigation.Current subsidies and schemes are fragmented and not designed for deep-sea operationsleading to slow adoption of green technologies and fleet modernisation.\n• Outdated Legal Framework:Existing laws regulate only coastal waters up to 12 nautical miles, leaving deep-sea areas poorly governedwhich creates loopholes and weak enforcement of sustainable fishing.Limited vessel tracking, lack of observer programs, and poor coordination among enforcement agenciesallow illegal, unreported, and unregulated (IUU) fishing to persist.Cross-border fishing and weak surveillance in sensitive maritime zonespose risks to maritime security and the safety of fishers.\n• Fragmented policy alignment with SDGs:Lack of integration between fisheries policies and global sustainability goals such asSDG 14 (Life Below Water)hampers holistic development and conservation of marine resources.",
        "summary": "Key challenges include lack of scientific stock assessment, weak infrastructure, technological gaps, limited access to finance, outdated legal frameworks, and fragmented policy alignment with SDGs."
    },
    {
        "title": "What are the Recommendations of NITI Aayog for India’s Deep-Sea and Offshore Fisheries?",
        "content": "• Policy & Regulation:Establish adedicated legal frameworkaligned with international standards (UNCLOS). Streamlinelicensing, registration, access policies, and incentivesto ensure sustainable and inclusive fishing.Empower institutions foreffective monitoring, control, and surveillance (MCS&E).\n• Institutional Strengthening & Capacity Building:Create a dedicated agency or directorate under the Department of Fisheries fordeep-sea governance.Enhance research, data collection, stock assessments, and advisory services with specialized vessels and infrastructure.Promoteexport-oriented cooperatives to leverage collective resourcesand market power.\n• Fleet Modernisation & Infrastructure:Supportmodern vesselswith refrigeration, onboard processing, and eco-friendly technology.Upgradedeep-sea fishing harbours, landing centres, cold chains, and post-harvest infrastructure. Promotecollective ownership modelsfor small-scale fishers through cooperatives and clusters.\n• Sustainable Fisheries Management:Implementmarine spatial planning, marine protected areas, and total allowable catch limits.Mandatebycatch reduction technologies and habitat protection measures.Deployreal-time monitoring, traceability systems, and eco-labelingfor sustainable practices.\n• Financing & Resource Mobilisation:Establish aDeep-Sea Fishing Development Fundthrough Pradhan Mantri Matsya Sampada Yojana (PMMSY) and industry contributions. Encouragepublic-private partnershipsin vessels and infrastructure development.Exploresoft loans or viability gap fundingfor green technologies.\n• Implementation Mechanism:Launch aDeep-Sea Fishing Program (DSFP)with a dedicated Programme Management Unit. Establish anadvisory councilof maritime states and relevant agencies for guidance and monitoring.",
        "summary": "Recommendations include policy and regulation, institutional strengthening and capacity building, fleet modernization and infrastructure, sustainable fisheries management, financing and resource mobilization, and an implementation mechanism."
    },
    {
        "title": "Conclusion",
        "content": "In line withPMMSYandSDG 14, NITI Aayog’s recommendations aim to ensure sustainable growth, ecosystem conservation, and inclusive development in India’s deep-sea and offshore fisheries.",
        "summary": "NITI Aayog’s recommendations aim to ensure sustainable growth, ecosystem conservation, and inclusive development in India’s deep-sea and offshore fisheries."
    },
    {
        "title": "Frequently Asked Questions (FAQs)",
        "content": "1. What is the Exclusive Economic Zone (EEZ)?The EEZ is a maritime zone up to 200 nautical miles from the coast, where a country has rights to explore, use, and manage resources like fisheries, oil, and minerals.\n2. What is the estimated potential yield of India’s Exclusive Economic Zone (EEZ)?India’s EEZ spans over 2 million sq. km with an estimated potential yield of 7.16 million tonnes, highlighting untapped deep-sea resources.\n3. What are the key challenges in India’s deep-sea and offshore fisheries?Challenges include lack of scientific stock assessment, weak infrastructure, technological gaps, high operational costs, limited finance, outdated legal frameworks, unsustainable fishing, and weak monitoring.\n4. How does NITI Aayog propose to modernise India’s fishing fleet and infrastructure?Through support for modern vessels with refrigeration, onboard processing, deep-sea harbours, landing centres, cold chains, and cooperative-based ownership models.",
        "summary": "FAQs cover the Exclusive Economic Zone, estimated potential yield of India’s EEZ, key challenges, and how NITI Aayog proposes to modernize the fishing fleet and infrastructure."
    },
    {
        "title": "Why in the News?",
        "content": "TheRegistrar General of India (RGI)released the“Vital Statistics of India based on Civil Registration System (CRS)”report for2023. The report highlighted a decline inbirth registrationsand a marginal increase indeath registrations.",
        "summary": "The Registrar General of India (RGI) released the Vital Statistics of India based on the Civil Registration System (CRS) report for 2023, highlighting changes in birth and death registrations."
    },
    {
        "title": "What are the Key Findings of the Vital Statistics Report 2023?",
        "content": "• Birth and Death Trends;India registered2.52 crore births in 2023, about2.32 lakh fewerthan in 2022, indicating a slight decline in the overall birth rate.The number ofregistered deaths stood at 86.6 lakh in 2023, aminor increasefrom86.5 lakh in 2022.There had been asharp spike in 2021, with1.02 crore deaths- an excess of nearly21 lakh deathsfrom 2020, coinciding with the second wave of COVID-19.\n• Sex Ratio at Birth (SRB):SRB refers to the number of female births per 1,000 male births.Lowest SRB:Reported inJharkhand (899), followed by Bihar (900), Telangana (906), Maharashtra (909), Gujarat (910), Haryana (911), and Mizoram (911).Highest SRB: Arunachal Pradeshled with a sex ratio of1,085 females per 1,000 males, followed by Nagaland (1,007), Goa (973), Ladakh and Tripura (972 each), and Kerala (967).\n• Institutional Births:About74.7% of total registered births in 2023occurred in health institutions, reflecting gradual improvement in maternal and neonatal healthcare access.Overall registration of birthsfor the year 2023 stood at98.4%Timelyregistrationrefers tobirths registered within 21 daysof occurrence.",
        "summary": "Key findings include birth and death trends, the Sex Ratio at Birth (SRB), and institutional births, with Arunachal Pradesh having the highest SRB and Jharkhand the lowest."
    },
    {
        "title": "What are the Reasons for the Skewed Sex Ratio in India?",
        "content": "• Gender Bias:A deep-rooted cultural preference for male heirs continues to dominate Indian society, where females areoften perceived as subordinate. This gender bias manifests in unequal access to education, healthcare, and even survival opportunities for girls.\n• Son Preference:Sons are traditionally viewed as future caretakers of parents and the principal economic supporters of the family. This belief reinforces the preference for male children, leading to discriminatory practices against female births.\n• Social Practices:Patriarchal customs, particularly thepractice of dowry, further discourage families from raising daughters.The financial burden associated with marriage often makes sons appear as economic assets, while daughters are seen as liabilities.\n• Rising Income Paradox:Contrary to expectations, the risein per capita income over the past six decadeshas not improved the sex ratio. Instead, higher income and literacy levels have made sex-selective technologies more accessible, thereby worsening gender imbalance in several regions.",
        "summary": "Reasons for the skewed sex ratio include gender bias, son preference, social practices like dowry, and the rising income paradox that has made sex-selective technologies more accessible."
    },
    {
        "title": "What Measures can be taken to Improve Sex Ratio in India?",
        "content": "• Behavioural Change:Long-term improvement requires a transformation in social attitudes.Government initiatives such as theBeti Bachao Beti Padhaocampaign should be further strengthened to promote gender equality and challenge patriarchal mindsets.\n• Youth Sensitization:Reaching out to the youth through reproductive health education and awareness programmes is crucial.The services ofAccredited Social Health Activists (ASHA)can be effectively leveraged in rural areas to spread awareness and encourage equitable practices.\n• Law Enforcement:A stronger legal framework is essential to curb sex-selective practices. ThePre-Conception and Pre-Natal Diagnostic Techniques (PCPNDT) Act, 1994must be implemented strictly.Additionally, the recent decision of theDrugs Technical Advisory Boardto includeultrasound machines under the Drugs and Cosmetics Actis a welcome step towards preventing their misuse for sex determination.",
        "summary": "Measures include behavioral change through campaigns, youth sensitization, and stronger law enforcement to curb sex-selective practices."
    },
    {
        "title": "Registrar General of India",
        "content": "• The Registrar General of Indiawas founded in 1961by the Government of India under theMinistry of Home Affairs.\n• It arranges, conducts and analyses the results of the demographic surveys of India including theCensus of Indiaand Linguistic Survey of India.\n• The position of Registrar is usually held by a civil servant holding the rank of Joint Secretary.",
        "summary": "The Registrar General of India, founded in 1961, is responsible for demographic surveys, including the Census of India."
    },
    {
        "title": "Civil Registration System(CRS)",
        "content": "• Civil Registration System (CRS) in India is theunified processof continuous, permanent, compulsory and universal recording of the vital events (births, deaths, stillbirths) and characteristics thereof.\n• The data generated through a complete and up-to-date CRS isessential for socio-economic planning.\n• Registration of Births and Deaths in India is mandatory with the enactment ofRegistration of Births and Deaths (RBD), Act 1969and is done as per the place of occurrence of the event.\n• According to the 2020-21 annual report of the Ministry of Home Affairs (MHA), the Central government is planning torevamp the Civil Registration System (CRS)to enable the registration of birth and death in real-time with minimum human interface that will be independent of location.",
        "summary": "The Civil Registration System (CRS) is the process of recording vital events. The Central government is planning to revamp the CRS for real-time registration."
    },
    {
        "title": "Conclusion",
        "content": "India has created several impressive goals to reduce its population growth rates, India and the rest of the world has a long way to go to achieve meaningful population policy which are not only based on quantitative control but qualitative control as well.",
        "summary": "India has impressive goals, and more work is needed to achieve meaningful population policy."
    },
    {
        "title": "Frequently Asked Questions",
        "content": "1. What does the 2023 Vital Statistics Report reveal?It shows fewer births (2.52 crore), slightly higher deaths (86.6 lakh), improved institutional births, and near-universal registration coverage.\n2. Which states had the best and worst sex ratios at birth?Arunachal Pradesh (1,085) and Nagaland (1,007) had the best, while Jharkhand (899) and Bihar (900) recorded the lowest ratios.\n3. What does India’s 98.4% birth registration rate indicate?It reflects near-universal coverage but highlights uneven timely registration, with only 11 States/UTs achieving over 90% compliance.",
        "summary": "FAQs cover the key findings of the 2023 Vital Statistics Report, including birth and death trends and SRB."
    },
    {
        "title": "Why in News?",
        "content": "The2025 Nobel Prize in Economic Scienceswas jointly awarded toJoel Mokyr (Netherlands), Philippe Aghion(Paris), and Peter Howitt(Canada)for explaininginnovation-driven economic growthand how societies must counter stagnation to sustain development.",
        "summary": "The 2025 Nobel Prize in Economic Sciences was jointly awarded to Joel Mokyr, Philippe Aghion, and Peter Howitt for explaining innovation-driven economic growth."
    },
    {
        "title": "What are the Key Highlights of the Nobel Prize in Economics 2025?",
        "content": "• Laureates and Core Contribution:Joel Mokyrreceived one-half of the prize for identifying prerequisites for sustained growth through technological progress.Mokyrusedhistorical datato reveal whysustained technological innovationis vital for continuouseconomic growth.Philippe AghionandPeter Howittshared theother halfof thetheoryofsustained growthviacreative destruction.AghionandHowittdeveloped amathematical modeldescribing \"creative destruction,\" wherenew productsandtechnologiesreplaceoutdated ones, propellingeconomic expansion.\n• Significance of the Research:The work explains why the pasttwo centuriesexperienced consistentglobal economic growth, improvingliving standardsandwell-being worldwide.It disrupts the assumption thateconomic growthis automatic, emphasizing thefragility of progressand the necessity to maintaininnovation-driven mechanisms.\n• Implications and Policy Insights:Their researchhighlights the importance for regions likeEuropeto integratecompetitionwith proactiveindustrial policy, learning from examples like theUSandChina.Thetheoryunderscores the need foreconomiesto encourage continuousinnovationandadaptationforsustained prosperity.",
        "summary": "The Nobel Prize recognizes the importance of sustained technological innovation, creative destruction, and innovation-driven economic growth, highlighting the need to encourage continuous innovation and adaptation for sustained prosperity."
    },
    {
        "title": "Frequently Asked Questions (FAQs)",
        "content": "1.Who were the recipients of the 2025 Nobel Prize in Economic Sciences ?Joel Mokyr; Philippe Aghion & Peter Howitt.\n2. What are the core contributions of the 2025 Nobel-winning research in economics?Innovation-driven economic growth, explains the Scientific-Technical Synergy behind Sustained Growth and the theory of creative destruction.\n3. How does the research provide policy insights for economic growth?Highlights need for competition, industrial policy, and continuous innovation.",
        "summary": "FAQs cover the recipients, core contributions, and policy insights of the 2025 Nobel Prize in Economic Sciences."
    },
    {
        "title": "Why in News?",
        "content": "TheMinistry of Environment, Forest and Climate Change (MoEFCC)has notified thefirst legally bindingGreenhouse GasEmission Intensity (GEI) Target Rules, 2025toreduce industrial emissions.",
        "summary": "The Ministry of Environment, Forest and Climate Change (MoEFCC) has notified the first legally binding Greenhouse Gas Emission Intensity (GEI) Target Rules, 2025."
    },
    {
        "title": "What are the GEI Target Rules, 2025?",
        "content": "• About:TheGEI Rulesset alegal limiton the amount ofgreenhouse gases (GHGs)that can beemitted per unit of product output(e.g., per tonne of cement or aluminium).It aims tooperationalize India’s Carbon Credit Trading Scheme (CCTS), 2023, strengthening the country’sclimate commitmentsunder theParis Agreement 2015.\n• Key Features:The rules set specificGHG emission limits(intonnes of CO2equivalent per tonne of product) for thealuminium, cement, chlor-alkali, and pulp and paper industries.A total of282 industrial unitsmustcomplywith these targets for thefinancial years 2025-26 and 2026-27.Emission intensityis measured astCO2e (tonnes of carbon dioxide equivalent), astandard unitthat accounts for theglobal warming potentialof allgreenhouse gases, not justCO2.\n• Compliance Mechanism:The system is designed to create amarket-driven incentiveforreducing emissionsthrough atradable credit system.Carbon Credits:Industriesthat reduce theiremissionsbelow the settargetwill earncarbon credit certificates, issued by theBureau of Energy Efficiency.Penalties for Non-Compliance:Industriesthat fail to meet theirtargetshave two options:Buy carbon creditsfrom thedomestic marketto cover theirshortfall.Face environmental compensation penaltiesimposed by theCentral Pollution Control Board.\n• Significance:Operationalizing the Carbon Market:Carbon creditscan betradedon thedomesticCarbon Credit Trading Scheme (CCTS), creating afinancial marketforcarbon reduction.Meeting International Commitments:This directly supportsIndia's pledgeunder theParis Agreementto reduce theemissions intensity of itsGDPby45% by 2030from2005 levels.Evolution from PAT Scheme:It moves beyond the earlierPerform, Achieve, Trade (PAT) schemeby creating aformal domestic market frameworkspecifically fortrading carbon credits, not just promotingenergy efficiency.",
        "summary": "The GEI Rules, 2025 set legal limits on GHG emissions per product output, operationalize the CCTS, and provide a compliance mechanism through carbon credits and penalties."
    },
    {
        "title": "Carbon Credit Trading Scheme, 2023",
        "content": "• About:TheCCTSis amarket-based mechanismtoprice GHG emissionsandtrade carbon credits, aidingIndia’s decarbonization.\n• Framework:CCTSintroducescarbon pricingvia two mechanisms:Compliance Mechanism:Mandatesenergy-intensive industriesto meetsector-specific GHG targets; exceeding targets earnsCarbon Credit Certificates (CCC), shortfalls requirepurchasing credits.Offset Mechanism:Enablesvoluntary entitiesto earncarbon creditsby reducing emissions.\n• Supervision:It issupervised by several government bodies, including theBEEand theNational Steering Committee for Indian Carbon Market (NSCICM).",
        "summary": "The Carbon Credit Trading Scheme (CCTS) is a market-based mechanism to price GHG emissions and trade carbon credits, including compliance and offset mechanisms, supervised by government bodies."
    },
    {
        "title": "Frequently Asked Questions (FAQs)",
        "content": "1. What is Greenhouse Gas Emission Intensity (GEI)?GEI is the amount of greenhouse gases (GHGs) emitted per unit of industrial product output, such as per tonne of cement or aluminium produced.\n2. What are the GEI Target Rules, 2025?They are India's first legally binding rules that set sector-specific emission intensity limits for the aluminium, cement, chlor-alkali, and pulp & paper industries to reduce their carbon footprint.\n3. What is the Carbon Credit Trading Scheme (CCTS)?The CCTS is a market-based mechanism to price GHG emissions and trade carbon credits, aiding India’s decarbonization.\n4. How is compliance with the GEI Rules ensured?Industries meeting targets earn carbon credits issued by the Bureau of Energy Efficiency, while non-compliance requires purchasing credits or paying environmental compensation under CPCB supervision.",
        "summary": "FAQs define Greenhouse Gas Emission Intensity (GEI), the GEI Target Rules, 2025, the Carbon Credit Trading Scheme (CCTS), and how compliance is ensured."
    },
    {
        "title": "Why in News?",
        "content": "TheMinistry of Mineshas officiallyreclassified all limestone as a major mineral, removing earlier end-use distinctions andpromoting ease of doing business.",
        "summary": "The Ministry of Mines has reclassified all limestone as a major mineral, promoting ease of doing business."
    },
    {
        "title": "What are the Key Highlights?",
        "content": "• Earlier, limestone used for lime in construction was aminor mineral, while other uses were classified asmajor mineral.\n• Limestone:It is asedimentary rockmainly composed ofcalcium carbonate (CaCO₃), sometimes containingdolomite, clay, iron carbonate, feldspar, pyrite, and quartz.Most limestones have agranular texture, with grains ranging from microscopic to visible shell fragments.\n• Significance:Limestone is rich in fossils, aiding the study of Earth’s history, and serves as a key source of phosphate for fertilizers.When heated to900–1000°C, limestone produceslime, which is widely used inglass manufacturing, agriculture, and various industries, while certain varieties are valued asbuilding stonesfor flooring, facings, and monuments.Reclassifying limestone as a major mineralallows free use in industries, boosting production, employment, and overall economic growth.",
        "summary": "Limestone has been reclassified as a major mineral, allowing free use in industries, boosting production, employment, and overall economic growth. Limestone is a sedimentary rock used in various industries."
    },
    {
        "title": "Major and Minor Minerals",
        "content": "• Major mineralsare those listed in the schedule of theMines and Minerals (Development and Regulation) Act, 1957 (MMDR Act)commonly includingCalcite, Clay, Coal, Quartz, and others, and are typically used in large-scale industrial applications.\n• Minor minerals, as defined under theMinor Mineral Concession Rulesframed by State Governments under theMMDR Act, 1957, include low-value materials primarily used in construction and small-scale industries.They include resources such as building stones, gravel, ordinary clay, and decorative stones.Additionally, any other mineral notified by the Central Government as a minor mineral also falls under this category.",
        "summary": "Major minerals are listed in the MMDR Act, 1957, and used in large-scale industrial applications. Minor minerals are primarily used in construction and small-scale industries."
    },
    {
        "title": "Why in News?",
        "content": "UNESCO has launched aVirtual Museum ofStolen Cultural Objects, a digital platform aimed at reconnecting communities with theirstolen heritageand confronting theillicit trafficking of cultural artifacts.",
        "summary": "UNESCO launched a Virtual Museum of Stolen Cultural Objects to reconnect communities with their stolen heritage."
    },
    {
        "title": "About:",
        "content": "• About:It waslaunched at the World Conference on Cultural Policies and Sustainable Development (MONDIACULT 2025), three years after being announced atMONDIACULT 2022 conference.MONDIACULTis aministerial forumof194UNESCOMember Statesthat sets theglobal cultural agenda, organized byUNESCOand hosted bySpain.\n• Objective:It aims toraise awareness, supportrecovery, and combatillicit trafficking of cultural property, especially linked tocolonialism, with the goal of eventuallyreturning the items to their rightful owners.\n• Features:It showcases around240 missing objectsfrom46 countries, usingAI-generated 3D modelsandinteractive access, with numbers expected todecrease as items are returned.\n• Indian Artifacts Featured:Natarajafigure (9thcentury sandstone sculpture)from Mahadev Temple, Pali, Chhattisgarh, representingShiva’s cosmic dance.Brahma sculpturewiththree faces, four arms, seated inlalitasana, symbolizingcreation and knowledge.\n• Significance:It supportsheritage protection, engagessource communities, offers adigital alternative to physical repatriation, and serves asreparation for colonial exploitationwithout patronizing.",
        "summary": "The virtual museum aims to raise awareness, support recovery, and combat illicit trafficking of cultural property, showcasing missing objects from around the world."
    },
    {
        "title": "Why in News?",
        "content": "Google is establishingIndia’s first gigawatt-scaledata centreandartificial intelligence (AI)hub in Visakhapatnam, expected to significantly transform Andhra Pradesh’s digital and economic landscape.",
        "summary": "Google is establishing India’s first gigawatt-scaled data center and AI hub in Visakhapatnam."
    },
    {
        "title": "Key Details",
        "content": "• This investment of approximately USD 15 billion over five years (2026–2030) marksGoogle’s largest investment in Indiato date and aligns with the Government of India’sViksit Bharat Vision,which seeks to accelerate the expansion of AI-driven services.\n• The project is expected to generate Rs10,000 crore in revenue, boosting state GDP and regional development, and strengthens India’s position in global digital infrastructure.\n• Data Center:It is a facility that housesInformation Technology (IT) infrastructure to store, manage, and deliver applications and data.Initially on-premises and privately owned, data centers have evolved intocloud and hyperscale facilitiesserving multiple clients.",
        "summary": "Google's investment of approximately USD 15 billion over five years marks its largest investment in India and will transform Andhra Pradesh’s digital and economic landscape."
    },
    {
        "title": "Significance of Data Centres in India’s Economic Growth:",
        "content": "Data centres are crucial forIndia’s digital economy, powering cloud services, AI,machine learning (ML), and digital platforms like e-commerce, banking, and social media.They support critical infrastructure in healthcare, finance, and government, while driving job creation, investment, and overall economic growth.",
        "summary": "Data centers are crucial for India’s digital economy, supporting critical infrastructure, job creation, and economic growth."
    }
]