{"overview": "This study guide covers Indian history, social justice (specifically female labor force participation), and recent developments related to Children's Day, migration surveys, water conservation, drone technology, anti-dumping duties, the Saranda Forest, and Nigeria's security issues.", "key_points": ["Janjatiya Gaurav Divas honors tribal contributions and freedom fighters like Birsa Munda.", "India aims to increase Female Labour Force Participation Rate (FLFPR) to 55% by 2030, with a focus on addressing challenges such as limited access to high-quality employment, the double burden of domestic and economic roles, and gender norms.", "Children's Day, observed on November 14th, marks Jawaharlal Nehru's birth anniversary and reflects his vision for child welfare.", "The National Migration Survey (2026-27) will provide updated data on migration patterns, reasons for migration, and impacts on migrants.", "The Jal Sanchay Jan Bhagidari (JSJB) initiative promotes community-driven water conservation and groundwater recharge.", "Andhra Pradesh is establishing a Drone City and a Space City to boost technology and economic growth.", "India imposed anti-dumping duties on hot-rolled steel imports from Vietnam to protect domestic industries.", "The Supreme Court directed the Jharkhand government to declare the Saranda forest as a wildlife sanctuary.", "Nigeria faces security challenges stemming from terrorist insurgencies, communal conflicts, and criminal banditry."], "important_terms": [{"term": "Janjatiya Gaurav Divas", "definition": "A day observed annually in India to honor tribal communities' contributions and freedom fighters."}, {"term": "Ulgulan", "definition": "The 'Great Tumult' movement led by Birsa Munda against British land policies."}, {"term": "FLFPR", "definition": "Female Labour Force Participation Rate - measures women in the workforce, employed or seeking work."}, {"term": "Beti Bachao Beti Padhao (BBBP)", "definition": "A government scheme aimed at improving girls' outcomes and long-term female workforce participation."}, {"term": "NSO Time Use Survey", "definition": "A survey used to recognize unpaid care work and redefine productive labor."}, {"term": "Usual Place of Residence (UPR)", "definition": "The place where a person has lived continuously for six months or more. Used in migration surveys."}, {"term": "Migration Rate", "definition": "The percentage of migrants within a specific population category."}, {"term": "Net Migration", "definition": "The difference between in-migration and out-migration for any region."}, {"term": "JSJB", "definition": "Jal Sanchay Jan Bhagidari - A community-driven program under Jal Shakti Abhiyan, promoting water conservation."}, {"term": "Drone City", "definition": "A dedicated zone for drone manufacturing, testing, and innovation."}, {"term": "Space City", "definition": "A planned hub for space-related industries."}, {"term": "Anti-dumping Duty", "definition": "A protective tariff on imports priced lower than their normal value in the exporting country."}, {"term": "Saranda Forest", "definition": "The largest Sal forest in Asia and a wildlife sanctuary located in Jharkhand."}, {"term": "Ho Tribe", "definition": "A tribal community inhabiting the Saranda Forest and is deeply linked to forest resources."}, {"term": "BRICS", "definition": "An association of five major emerging economies: Brazil, Russia, India, China, and South Africa, Nigeria is a BRICS partner country."}], "processes_or_flows": [{"title": "Steps to improve FLFPR", "steps": ["Redesigning labor metrics for quality work.", "Creating gender-sensitive formal employment.", "Strengthening care and social infrastructure.", "Skill building and digital empowerment.", "Tackling social norms."]}], "examples": ["Birsa Munda led the Ulgulan movement.", "The Chotanagpur Tenancy Act, 1908, secured tribal land rights.", "Examples of Tribal Freedom Fighters: Veer Narayan Singh, Badal Bhoi, Raja Shankar Shah, and Kunwar Raghunath Shah.", "The 3Cs of JSJB: Community, CSR, and Cost.", "Institutions Nehru created include IITs, AIIMS, and ISRO.", "The First Five-Year Plan focused on agriculture, irrigation, and food security."]}